apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m0_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_pwm_m0_v1.c
 *
 * SPDX-License-Identifier: BSD-3-Clause
 * SPDX-FileCopyrightText: 2019 Fundação CERTI. All rights reserved.
 * SPDX-FileContributor: Daniel Pereira Volpato <dpo@certi.org.br>
 * SPDX-FileContributor: Guillherme da Silva Amaral <gvr@certi.org.br>
 * SPDX-FileContributor: Gregory Nutt <gnutt@nuttx.org>
 * SPDX-FileContributor: Paul Alexander Patience <paul-a.patience@polymtl.ca>
 * SPDX-FileContributor: Mateusz Szafoni <raiden00@railab.me>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/timers/pwm.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_gpio.h"
#include "stm32_pwm.h"
#include "stm32_rcc.h"

/* This module then only compiles if there is at least one enabled timer
 * intended for use with the PWM upper half driver.
 */

#if defined(CONFIG_STM32_TIM1_PWM)  || defined(CONFIG_STM32_TIM2_PWM)   || \
    defined(CONFIG_STM32_TIM3_PWM)  || defined(CONFIG_STM32_TIM14_PWM)  || \
    defined(CONFIG_STM32_TIM15_PWM) || defined(CONFIG_STM32_TIM16_PWM)  || \
    defined(CONFIG_STM32_TIM17_PWM)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PWM/Timer Definitions ****************************************************/

/* The following definitions are used to identify the various time types */

#define TIMTYPE_BASIC        0  /* Basic timers: TIM6,7 */
#define TIMTYPE_GENERAL16    1  /* General 16-bit timers: TIM3 */
#define TIMTYPE_COUNTUP16    2  /* General 16-bit count-up timers: TIM14 */
#define TIMTYPE_GENERAL32    3  /* General 32-bit timers: TIM2 */
#define TIMTYPE_ADVANCED     4  /* Advanced timers:  TIM1 */
#define TIMTYPE_COUNTUP16_N  5  /* General 16-bit count-up timers with
                                 * one complementary output: TIM15-17
                                 */

#define TIMTYPE_TIM1         TIMTYPE_ADVANCED
#define TIMTYPE_TIM2         TIMTYPE_GENERAL32
#define TIMTYPE_TIM3         TIMTYPE_GENERAL16
#define TIMTYPE_TIM6         TIMTYPE_BASIC
#define TIMTYPE_TIM7         TIMTYPE_BASIC
#define TIMTYPE_TIM14        TIMTYPE_COUNTUP16
#define TIMTYPE_TIM15        TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_TIM16        TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_TIM17        TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */

/* Advanced timer */

#if defined (CONFIG_STM32_TIM1_PWM)
#  define HAVE_IP_TIMERS_V2 1
#endif

#if defined(CONFIG_STM32_TIM1_PWM)  || \
    defined(CONFIG_STM32_TIM8_PWM)  || \
    defined(CONFIG_STM32_TIM15_PWM) || \
    defined(CONFIG_STM32_TIM16_PWM) || \
    defined(CONFIG_STM32_TIM17_PWM)
#   define HAVE_ADVTIM
#else
#   undef HAVE_ADVTIM
#endif

/* CCMR2 */

#if defined(CONFIG_STM32_TIM1_PWM)  || \
    defined(CONFIG_STM32_TIM3_PWM)
#   define HAVE_CCMR2
#else
#   undef HAVE_CCMR2
#endif

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
#  define pwm_dumpgpio(p,m)
#  warning "pwm_dumpgpio not implemented"
#else
#  define pwm_dumpgpio(p,m)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum stm32_timmode_e
{
  STM32_TIMMODE_COUNTUP   = 0,
  STM32_TIMMODE_COUNTDOWN = 1,
  STM32_TIMMODE_CENTER1   = 2,
  STM32_TIMMODE_CENTER2   = 3,
  STM32_TIMMODE_CENTER3   = 4,
};

enum stm32_chanmode_e
{
  STM32_CHANMODE_PWM1        = 0,
  STM32_CHANMODE_PWM2        = 1,
  STM32_CHANMODE_COMBINED1   = 2,
  STM32_CHANMODE_COMBINED2   = 3,
  STM32_CHANMODE_ASYMMETRIC1 = 4,
  STM32_CHANMODE_ASYMMETRIC2 = 5,
};

struct stm32_pwmchan_s
{
  uint8_t channel;                     /* Timer output channel: {1,..4} */
  enum stm32_chanmode_e mode;
  uint32_t pincfg;                     /* Output pin configuration */
  uint32_t npincfg;                    /* Complementary output pin configuration
                                        * (only TIM1,8 CH1-3 and TIM15,16,17 CH1)
                                        */
};

/* This structure represents the state of one PWM timer */

struct stm32_pwmtimer_s
{
  const struct pwm_ops_s *ops;     /* PWM operations */
  struct stm32_pwmchan_s channels[PWM_NCHANNELS];
  uint8_t timid;                       /* Timer ID {1,...,17} */
  uint8_t timtype;                     /* See the TIMTYPE_* definitions */
  enum stm32_timmode_e mode;
  uint32_t frequency;                  /* Current frequency setting */
  uint32_t base;                       /* The base address of the timer */
  uint32_t pclk;                       /* The frequency of the peripheral clock
                                        * that drives the timer module. */
};

/****************************************************************************
 * Static Function Prototypes
 ****************************************************************************/

/* Register access */

static uint32_t stm32pwm_getreg(struct stm32_pwmtimer_s *priv, int offset);
static void stm32pwm_putreg(struct stm32_pwmtimer_s *priv, int offset,
                            uint32_t value);
static void stm32pwm_modifyreg(struct stm32_pwmtimer_s *priv,
                               uint32_t offset, uint32_t clearbits,
                               uint32_t setbits);

#ifdef CONFIG_DEBUG_PWM_INFO
static void stm32pwm_dumpregs(struct stm32_pwmtimer_s *priv,
                              const char *msg);
#else
#  define stm32pwm_dumpregs(priv,msg)
#endif

/* Timer management */

static int stm32pwm_timer(struct stm32_pwmtimer_s *priv,
                          const struct pwm_info_s *info);
static int stm32pwm_output_configure(struct stm32_pwmtimer_s *priv,
                                     uint8_t channel);
static  int stm32pwm_update_duty(struct stm32_pwmtimer_s *priv,
                                 uint8_t channel, ub16_t duty);
static void stm32pwm_setapbclock(struct stm32_pwmtimer_s *priv, bool on);

/* PWM driver methods */

static int stm32pwm_setup(struct pwm_lowerhalf_s *dev);
static int stm32pwm_shutdown(struct pwm_lowerhalf_s *dev);

static int stm32pwm_start(struct pwm_lowerhalf_s *dev,
                          const struct pwm_info_s *info);

static int stm32pwm_stop(struct pwm_lowerhalf_s *dev);
static int stm32pwm_ioctl(struct pwm_lowerhalf_s *dev,
                          int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This is the list of lower half PWM driver methods used by the upper half
 * driver
 */

static const struct pwm_ops_s g_pwmops =
{
  .setup       = stm32pwm_setup,
  .shutdown    = stm32pwm_shutdown,
  .start       = stm32pwm_start,
  .stop        = stm32pwm_stop,
  .ioctl       = stm32pwm_ioctl,
};

#ifdef CONFIG_STM32_TIM1_PWM
static struct stm32_pwmtimer_s g_pwm1dev =
{
  .ops         = &g_pwmops,
  .timid       = 1,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM1_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM1_CH1CFG,
      .mode    = CONFIG_STM32_TIM1_CH1MODE,
      .npincfg = PWM_TIM1_CH1NCFG,
    },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL2
    {
      .channel = 2,
      .pincfg  = PWM_TIM1_CH2CFG,
      .mode    = CONFIG_STM32_TIM1_CH2MODE,
      .npincfg = PWM_TIM1_CH2NCFG,
    },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL3
    {
      .channel = 3,
      .pincfg  = PWM_TIM1_CH3CFG,
      .mode    = CONFIG_STM32_TIM1_CH3MODE,
      .npincfg = PWM_TIM1_CH3NCFG,
    },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL4
    {
      .channel = 4,
      .pincfg  = PWM_TIM1_CH4CFG,
      .mode    = CONFIG_STM32_TIM1_CH4MODE,
      .npincfg = 0,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM1,
  .mode        = CONFIG_STM32_TIM1_MODE,
  .base        = STM32_TIM1_BASE,
  .pclk        = STM32_APB2_TIM1_CLKIN,
};
#endif

#ifdef CONFIG_STM32_TIM2_PWM
static struct stm32_pwmtimer_s g_pwm2dev =
{
  .ops         = &g_pwmops,
  .timid       = 2,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM2_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM2_CH1CFG,
      .mode    = CONFIG_STM32_TIM2_CH1MODE,
      .npincfg = 0,
    },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL2
    {
      .channel = 2,
      .pincfg  = PWM_TIM2_CH2CFG,
      .mode    = CONFIG_STM32_TIM2_CH2MODE,
      .npincfg = 0,
    },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL3
    {
      .channel = 3,
      .pincfg  = PWM_TIM2_CH3CFG,
      .mode    = CONFIG_STM32_TIM2_CH3MODE,
      .npincfg = 0,
    },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL4
    {
      .channel = 4,
      .pincfg  = PWM_TIM2_CH4CFG,
      .mode    = CONFIG_STM32_TIM2_CH4MODE,
      .npincfg = 0,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM2,
  .mode        = CONFIG_STM32_TIM2_MODE,
  .base        = STM32_TIM2_BASE,
  .pclk        = STM32_APB1_TIM2_CLKIN,
};
#endif

#ifdef CONFIG_STM32_TIM3_PWM
static struct stm32_pwmtimer_s g_pwm3dev =
{
  .ops         = &g_pwmops,
  .timid       = 3,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM3_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM3_CH1CFG,
      .mode    = CONFIG_STM32_TIM3_CH1MODE,
      .npincfg = 0,
    },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL2
    {
      .channel = 2,
      .pincfg  = PWM_TIM3_CH2CFG,
      .mode    = CONFIG_STM32_TIM3_CH2MODE,
      .npincfg = 0,
    },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL3
    {
      .channel = 3,
      .pincfg  = PWM_TIM3_CH3CFG,
      .mode    = CONFIG_STM32_TIM3_CH3MODE,
      .npincfg = 0,
    },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL4
    {
      .channel = 4,
      .pincfg  = PWM_TIM3_CH4CFG,
      .mode    = CONFIG_STM32_TIM3_CH4MODE,
      .npincfg = 0,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM3,
  .mode        = CONFIG_STM32_TIM3_MODE,
  .base        = STM32_TIM3_BASE,
  .pclk        = STM32_APB1_TIM3_CLKIN,
};
#endif

