apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m0_v1.c
#ifdef CONFIG_STM32_TIM14_PWM
static struct stm32_pwmtimer_s g_pwm14dev =
{
  .ops         = &g_pwmops,
  .timid       = 14,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM14_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM14_CH1CFG,
      .mode    = CONFIG_STM32_TIM14_CH1MODE,
      .npincfg = PWM_TIM14_CH1NCFG,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM14,
  .mode        = STM32_TIMMODE_COUNTUP,
  .base        = STM32_TIM14_BASE,
  .pclk        = STM32_APB2_TIM14_CLKIN,
};
#endif

#ifdef CONFIG_STM32_TIM15_PWM
static struct stm32_pwmtimer_s g_pwm15dev =
{
  .ops         = &g_pwmops,
  .timid       = 15,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM15_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM15_CH1CFG,
      .mode    = CONFIG_STM32_TIM15_CH1MODE,
      .npincfg = PWM_TIM15_CH1NCFG,
    },
#endif
#ifdef CONFIG_STM32_TIM15_CHANNEL2
    {
      .channel = 2,
      .pincfg  = PWM_TIM15_CH2CFG,
      .mode    = CONFIG_STM32_TIM15_CH2MODE,
      .npincfg = 0,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM15,
  .mode        = STM32_TIMMODE_COUNTUP,
  .base        = STM32_TIM15_BASE,
  .pclk        = STM32_APB2_TIM15_CLKIN,
};
#endif

#ifdef CONFIG_STM32_TIM16_PWM
static struct stm32_pwmtimer_s g_pwm16dev =
{
  .ops         = &g_pwmops,
  .timid       = 16,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM16_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM16_CH1CFG,
      .mode    = CONFIG_STM32_TIM16_CH1MODE,
      .npincfg = PWM_TIM16_CH1NCFG,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM16,
  .mode        = STM32_TIMMODE_COUNTUP,
  .base        = STM32_TIM16_BASE,
  .pclk        = STM32_APB2_TIM16_CLKIN,
};
#endif

#ifdef CONFIG_STM32_TIM17_PWM
static struct stm32_pwmtimer_s g_pwm17dev =
{
  .ops         = &g_pwmops,
  .timid       = 17,
  .channels    =
  {
#ifdef CONFIG_STM32_TIM17_CHANNEL1
    {
      .channel = 1,
      .pincfg  = PWM_TIM17_CH1CFG,
      .mode    = CONFIG_STM32_TIM17_CH1MODE,
      .npincfg = PWM_TIM17_CH1NCFG,
    },
#endif
  },
  .timtype     = TIMTYPE_TIM17,
  .mode        = STM32_TIMMODE_COUNTUP,
  .base        = STM32_TIM17_BASE,
  .pclk        = STM32_APB2_TIM17_CLKIN,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32pwm_reg_is_32bit
 *
 * Description:
 *   Verify whether the timer register is 32bit or not.
 *
 * Input Parameters:
 *   timtype - The type of the timer. See the TIMTYPE_* definitions
 *   offset  - The offset to the register to read
 *
 * Returned Value:
 *   Return true for 32 bits register; false otherwise.
 *
 ****************************************************************************/

static bool stm32pwm_reg_is_32bit(uint8_t timtype, uint32_t offset)
{
  if (offset == STM32_GTIM_CCMR1_OFFSET ||
      offset == STM32_GTIM_SMCR_OFFSET  ||
      offset == STM32_GTIM_BDTR_OFFSET)
    {
      return true;
    }

  if (timtype == TIMTYPE_GENERAL16)
    {
      if (offset == STM32_GTIM_CCMR2_OFFSET ||
          offset == STM32_GTIM_AF1_OFFSET   ||
          offset == STM32_GTIM_TISEL_OFFSET)
        {
          return true;
        }
    }
  else if (timtype == TIMTYPE_GENERAL32)
    {
      if (offset == STM32_GTIM_CNT_OFFSET  ||
          offset == STM32_GTIM_ARR_OFFSET  ||
          offset == STM32_GTIM_CCR1_OFFSET ||
          offset == STM32_GTIM_CCR2_OFFSET ||
          offset == STM32_GTIM_CCR3_OFFSET ||
          offset == STM32_GTIM_CCR4_OFFSET)
        {
          return true;
        }
    }
  else if (timtype == TIMTYPE_ADVANCED)
    {
      if (offset == STM32_ATIM_CR2_OFFSET   ||
          offset == STM32_ATIM_CCMR2_OFFSET ||
          offset == STM32_ATIM_CCER_OFFSET  ||
          offset == STM32_ATIM_DMAR_OFFSET  ||
          offset == STM32_ATIM_CCMR3_OFFSET ||
          offset == STM32_ATIM_CCR5_OFFSET  ||
          offset == STM32_ATIM_AF1_OFFSET   ||
          offset == STM32_ATIM_TISEL_OFFSET)
        {
          return true;
        }
    }

  return false;
}

/****************************************************************************
 * Name: stm32pwm_getreg
 *
 * Description:
 *   Read the value of an PWM timer register
 *
 * Input Parameters:
 *   priv   - A reference to the PWM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t stm32pwm_getreg(struct stm32_pwmtimer_s *priv, int offset)
{
  uint32_t retval;

  if (stm32pwm_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      retval = getreg32(priv->base + offset);
    }
  else
    {
      /* 16-bit register */

      retval = getreg16(priv->base + offset);
    }

  /* Return 32-bit value */

  return retval;
}

/****************************************************************************
 * Name: stm32pwm_putreg
 *
 * Description:
 *   Read the value of an PWM timer register
 *
 * Input Parameters:
 *   priv   - A reference to the PWM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32pwm_putreg(struct stm32_pwmtimer_s *priv, int offset,
                            uint32_t value)
{
  if (stm32pwm_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      putreg32(value, priv->base + offset);
    }
  else
    {
      /* 16-bit register */

      putreg16((uint16_t)value, priv->base + offset);
    }
}

/****************************************************************************
 * Name: stm32pwm_modifyreg
 *
 * Description:
 *   Modify PWM register (32-bit or 16-bit)
 *
 * Input Parameters:
 *   priv    - A reference to the PWM block status
 *   offset  - The offset to the register to read
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32pwm_modifyreg(struct stm32_pwmtimer_s *priv,
                               uint32_t offset, uint32_t clearbits,
                               uint32_t setbits)
{
  if (stm32pwm_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      modifyreg32(priv->base + offset, clearbits, setbits);
    }
  else
    {
      /* 16-bit register */

      modifyreg16(priv->base + offset, clearbits, setbits);
    }
}

/****************************************************************************
 * Name: stm32pwm_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *   msg  - A message to be printed on the screen
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
static void stm32pwm_dumpregs(struct stm32_pwmtimer_s *priv,
                              const char *msg)
{
  pwminfo("%s:\n", msg);
  pwminfo("  CR1: %04x CR2:  %04x SMCR:  %04x DIER:  %04x\n",
          stm32pwm_getreg(priv, STM32_GTIM_CR1_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CR2_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_SMCR_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_DIER_OFFSET));
  pwminfo("   SR: %04x EGR:  %04x CCMR1: %04x CCMR2: %04x\n",
          stm32pwm_getreg(priv, STM32_GTIM_SR_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_EGR_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CCMR1_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CCMR2_OFFSET));
  pwminfo(" CCER: %04x CNT:  %04x PSC:   %04x ARR:   %04x\n",
          stm32pwm_getreg(priv, STM32_GTIM_CCER_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CNT_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_PSC_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_ARR_OFFSET));
  pwminfo(" CCR1: %04x CCR2: %04x CCR3:  %04x CCR4:  %04x\n",
          stm32pwm_getreg(priv, STM32_GTIM_CCR1_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CCR2_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CCR3_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_CCR4_OFFSET));
#if defined(CONFIG_STM32_TIM1_PWM) || defined(CONFIG_STM32_TIM8_PWM)
  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      pwminfo("  RCR: %04x BDTR: %04x DCR:   %04x DMAR:  %04x\n",
          stm32pwm_getreg(priv, STM32_ATIM_RCR_OFFSET),
          stm32pwm_getreg(priv, STM32_ATIM_BDTR_OFFSET),
          stm32pwm_getreg(priv, STM32_ATIM_DCR_OFFSET),
          stm32pwm_getreg(priv, STM32_ATIM_DMAR_OFFSET));

          pwminfo("  AF1: %04x TISEL: %04x\n",
          stm32pwm_getreg(priv, STM32_ATIM_AF1_OFFSET),
          stm32pwm_getreg(priv, STM32_ATIM_TISEL_OFFSET));
    }
  else
#endif
    {
      pwminfo("  RCR: %04x BDTR: %04x DCR:   %04x DMAR:  %04x\n",
          stm32pwm_getreg(priv, STM32_GTIM_RCR_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_BDTR_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_DCR_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_DMAR_OFFSET));
      pwminfo("  AF1: %04x TISEL: %04x\n",
          stm32pwm_getreg(priv, STM32_GTIM_AF1_OFFSET),
          stm32pwm_getreg(priv, STM32_GTIM_TISEL_OFFSET));
    }
}
#endif

/****************************************************************************
 * Name: stm32pwm_output_configure
 *
 * Description:
 *   Configure PWM output for given channel
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *   channel - Timer output channel
 *
 * Returned Value:
 *   Zero on success;
 ****************************************************************************/

static int stm32pwm_output_configure(struct stm32_pwmtimer_s *priv,
                                     uint8_t channel)
{
  uint32_t cr2;
  uint32_t ccer;

  /* Get current registers state */

  cr2  = stm32pwm_getreg(priv, STM32_GTIM_CR2_OFFSET);
  ccer = stm32pwm_getreg(priv, STM32_GTIM_CCER_OFFSET);

  /* Reset the output polarity level of all channels (selects high
   * polarity)
   */

