apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m0_v1.c
  cr1 &= ~GTIM_CR1_CKD_MASK;
  stm32pwm_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  /* Set the reload and prescaler values */

  stm32pwm_putreg(priv, STM32_GTIM_ARR_OFFSET, reload);
  stm32pwm_putreg(priv, STM32_GTIM_PSC_OFFSET, (prescaler - 1));

  /* Set the advanced timer's repetition counter */

#if defined(CONFIG_STM32_TIM1_PWM) || defined(CONFIG_STM32_TIM8_PWM)
  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      /* If a non-zero repetition count has been selected, then set the
       * repetition counter to the count-1 (stm32pwm_start() has already
       * assured us that the count value is within range).
       */

        {
          /* Set the repetition counter to zero */

          stm32pwm_putreg(priv, STM32_ATIM_RCR_OFFSET, 0);

          /* Generate an update event to reload the prescaler */

          stm32pwm_putreg(priv, STM32_ATIM_EGR_OFFSET, ATIM_EGR_UG);
        }
    }
  else
#endif
    {
      /* Generate an update event to reload the prescaler (all timers) */

      stm32pwm_putreg(priv, STM32_GTIM_EGR_OFFSET, GTIM_EGR_UG);
    }

  /* Handle channel specific setup */

  ocmode1   = 0;
#if defined(HAVE_CCMR2)
  ocmode2   = 0;
#endif

  for (i = 0; i < CONFIG_PWM_NCHANNELS; i++)
    {
      ub16_t                duty;
      uint32_t              chanmode;
      bool                  ocmbit = false;
      uint8_t               channel;
      int                   j;
      enum stm32_chanmode_e mode;

      /* Break the loop if all following channels are not configured */

      if (info->channels[i].channel == -1)
        {
          break;
        }

      duty = info->channels[i].duty;
      channel = info->channels[i].channel;

      /* A value of zero means to skip this channel */

      if (channel == 0)
        {
          continue;
        }

      /* Find the channel */

      for (j = 0; j < PWM_NCHANNELS; j++)
        {
          if (priv->channels[j].channel == channel)
            {
              mode = priv->channels[j].mode;
              break;
            }
        }

      if (j >= PWM_NCHANNELS)
        {
          pwmerr("ERROR: No such channel: %u\n", channel);
          return -EINVAL;
        }

      /* Duty cycle:
       *
       * duty cycle = ccr / reload (fractional value)
       */

      ccr = b16toi(duty * reload + b16HALF);

      pwminfo("ccr: %" PRIu32 "\n", ccr);

      switch (mode)
        {
          case STM32_CHANMODE_PWM1:
            chanmode = GTIM_CCMR_MODE_PWM1;
            break;

          case STM32_CHANMODE_PWM2:
            chanmode = GTIM_CCMR_MODE_PWM2;
            break;

          case STM32_CHANMODE_COMBINED1:
            chanmode = GTIM_CCMR_MODE_COMBINED1;
            ocmbit = true;
            break;

          case STM32_CHANMODE_COMBINED2:
            chanmode = GTIM_CCMR_MODE_COMBINED2;
            ocmbit = true;
            break;

          case STM32_CHANMODE_ASYMMETRIC1:
            chanmode = GTIM_CCMR_MODE_ASYMMETRIC1;
            ocmbit = true;
            break;

          case STM32_CHANMODE_ASYMMETRIC2:
            chanmode = GTIM_CCMR_MODE_ASYMMETRIC2;
            ocmbit = true;
            break;

          default:
            pwmerr("ERROR: No such mode: %u\n", (unsigned int)mode);
            return -EINVAL;
        }

      switch (channel)
        {
          case 1:  /* PWM Mode configuration: Channel 1 */
            {
              /* Set the CCMR1 mode values (leave CCMR2 zero) */

              ocmode1  |= (GTIM_CCMR_CCS_CCOUT << GTIM_CCMR1_CC1S_SHIFT) |
                          (chanmode << GTIM_CCMR1_OC1M_SHIFT) |
                          GTIM_CCMR1_OC1PE;

              if (ocmbit)
                {
                  ocmode1 |= GTIM_CCMR1_OC1M;
                }

              /* Set the duty cycle by writing to the CCR register for this
               * channel.
               */

              stm32pwm_putreg(priv, STM32_GTIM_CCR1_OFFSET, ccr);

              /* Reset the Output Compare Mode Bits and set the select
               * output compare mode.
               */

              ccmr1 &= ~(GTIM_CCMR1_CC1S_MASK | GTIM_CCMR1_OC1M_MASK |
                         GTIM_CCMR1_OC1PE | GTIM_CCMR1_OC1M);
              stm32pwm_output_configure(priv, channel);
            }
            break;

          case 2:  /* PWM Mode configuration: Channel 2 */
            {
              /* Set the CCMR1 mode values (leave CCMR2 zero) */

              ocmode1  |= (GTIM_CCMR_CCS_CCOUT << GTIM_CCMR1_CC2S_SHIFT) |
                          (chanmode << GTIM_CCMR1_OC2M_SHIFT) |
                          GTIM_CCMR1_OC2PE;

              if (ocmbit)
                {
                  ocmode1 |= GTIM_CCMR1_OC2M;
                }

              /* Set the duty cycle by writing to the CCR register for this
               * channel.
               */

              stm32pwm_putreg(priv, STM32_GTIM_CCR2_OFFSET, ccr);

              /* Reset the Output Compare Mode Bits and set the select
               * output compare mode.
               */

              ccmr1 &= ~(GTIM_CCMR1_CC2S_MASK | GTIM_CCMR1_OC2M_MASK |
                         GTIM_CCMR1_OC2PE | GTIM_CCMR1_OC2M);
              stm32pwm_output_configure(priv, channel);
            }
            break;

#if defined(HAVE_CCMR2)
          case 3:  /* PWM Mode configuration: Channel 3 */
            {
              /* Set the CCMR2 mode values (leave CCMR1 zero) */

              ocmode2  |= (ATIM_CCMR_CCS_CCOUT << ATIM_CCMR2_CC3S_SHIFT) |
                          (chanmode << ATIM_CCMR2_OC3M_SHIFT) |
                          ATIM_CCMR2_OC3PE;

              if (ocmbit)
                {
                  ocmode2 |= ATIM_CCMR2_OC3M;
                }

              /* Set the duty cycle by writing to the CCR register for this
               * channel.
               */

              stm32pwm_putreg(priv, STM32_ATIM_CCR3_OFFSET, ccr);

              /* Reset the Output Compare Mode Bits and set the select
               * output compare mode.
               */

              ccmr2 &= ~(ATIM_CCMR2_CC3S_MASK | ATIM_CCMR2_OC3M_MASK |
                         ATIM_CCMR2_OC3PE | ATIM_CCMR2_OC3M);
              stm32pwm_output_configure(priv, channel);
            }
            break;

